In [2]:
import pandas as pd
import numpy as np

# Series

In [2]:
lable = ['a', 'b', 'c']
data = [10,20,30]

In [3]:
a = np.array(data)

In [6]:
print(a)

[10 20 30]

In [8]:
pd.Series(a)

0    10
1    20
2    30
dtype: int32

In [9]:
pd.Series(data = a, index = lable)

a    10
b    20
c    30
dtype: int32

In [10]:
di = {'a':10, 'b':20, 'c':30}

In [11]:
pd.Series(data = di)

a    10
b    20
c    30
dtype: int64

In [12]:
sri1 = pd.Series([1,2,3],['U','G','J'])

In [13]:
sri1

U    1
G    2
J    3
dtype: int64

In [14]:
sri2 = pd.Series([10,20,30], ['U','G','J'])

In [15]:
sri2

U    10
G    20
J    30
dtype: int64

In [16]:
sri1+sri2

U    11
G    22
J    33
dtype: int64

In [18]:
sri1*sri2

U    10
G    40
J    90
dtype: int64

In [19]:
pd.Series??

## Indexing and slicing

In [20]:
data = np.array([10,20,30,40,50])

In [21]:
s = pd.Series(data)

In [22]:
s

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [23]:
s[3]

40

In [24]:
s[1:4]

1    20
2    30
3    40
dtype: int32

In [25]:
s[2:]

2    30
3    40
4    50
dtype: int32

# Data Frame

In [30]:
pd.DataFrame??

In [28]:
df = pd.DataFrame(np.random.randint(1,100, size = (5,4)))

In [29]:
df

    0   1   2   3
0  16  55  52  73
1  68  89  41  46
2  24  20   1   6
3  80  56   9  90
4  38  93  86  49

In [31]:
df = pd.DataFrame(np.random.randint(1,100, size = (5,4)), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [32]:
df

    W   X   Y   Z
A  22  52  79  10
B  57  93  79   7
C  37  11  82  59
D  73  33  83  62
E  70  44  55  65

## Selecting Rows and Columns

In [33]:
df = pd.DataFrame(np.random.randint(1,100, size = (5,4)), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [34]:
df

    W   X   Y   Z
A  31  41  21  80
B  97  53  36  61
C  65  65  11  26
D  71  75  95  73
E  68  41  61  56

In [35]:
df['W']

A    31
B    97
C    65
D    71
E    68
Name: W, dtype: int32

In [36]:
df.W

A    31
B    97
C    65
D    71
E    68
Name: W, dtype: int32

In [37]:
df[['W', 'Z']]

    W   Z
A  31  80
B  97  61
C  65  26
D  71  73
E  68  56

In [38]:
df.loc['C']

W    65
X    65
Y    11
Z    26
Name: C, dtype: int32

In [39]:
df.iloc[2]

W    65
X    65
Y    11
Z    26
Name: C, dtype: int32

In [41]:
df.loc['B','Y']

36

In [42]:
df.loc[['A','B'],['W','Y']]

    W   Y
A  31  21
B  97  36

## Creating new columns and rows

In [43]:
df

    W   X   Y   Z
A  31  41  21  80
B  97  53  36  61
C  65  65  11  26
D  71  75  95  73
E  68  41  61  56

In [44]:
df['NC'] = df['W'] + df['Y']

In [45]:
df

    W   X   Y   Z   NC
A  31  41  21  80   52
B  97  53  36  61  133
C  65  65  11  26   76
D  71  75  95  73  166
E  68  41  61  56  129

In [46]:
df.loc['NR'] = df.loc['A']+df.loc['C']

In [47]:
df

     W    X   Y    Z   NC
A   31   41  21   80   52
B   97   53  36   61  133
C   65   65  11   26   76
D   71   75  95   73  166
E   68   41  61   56  129
NR  96  106  32  106  128

## Removing rows and columns

In [48]:
df = pd.DataFrame(np.random.randint(1,100, size = (5,4)), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [49]:
df['NC'] = df['W'] + df['Y']

In [50]:
df.loc['NR'] = df.loc['A']+df.loc['C']

In [51]:
df

     W   X    Y    Z   NC
A   33  24   68   95  101
B   17  65   30   14   47
C    6   3   72   55   78
D   85  73   85   74  170
E   67  79   67   10  134
NR  39  27  140  150  179

In [52]:
df.drop('NR')

    W   X   Y   Z   NC
A  33  24  68  95  101
B  17  65  30  14   47
C   6   3  72  55   78
D  85  73  85  74  170
E  67  79  67  10  134

In [53]:
df

     W   X    Y    Z   NC
A   33  24   68   95  101
B   17  65   30   14   47
C    6   3   72   55   78
D   85  73   85   74  170
E   67  79   67   10  134
NR  39  27  140  150  179

In [54]:
df.drop('NR', inplace = True)

In [55]:
df

    W   X   Y   Z   NC
A  33  24  68  95  101
B  17  65  30  14   47
C   6   3  72  55   78
D  85  73  85  74  170
E  67  79  67  10  134

In [56]:
df.drop??

In [57]:
df.drop('NC',axis = 1)

    W   X   Y   Z
A  33  24  68  95
B  17  65  30  14
C   6   3  72  55
D  85  73  85  74
E  67  79  67  10

In [58]:
df

    W   X   Y   Z   NC
A  33  24  68  95  101
B  17  65  30  14   47
C   6   3  72  55   78
D  85  73  85  74  170
E  67  79  67  10  134

In [59]:
df.drop('NC',axis = 1, inplace = True)

In [60]:
df

    W   X   Y   Z
A  33  24  68  95
B  17  65  30  14
C   6   3  72  55
D  85  73  85  74
E  67  79  67  10

In [61]:
df.shape

(5, 4)

## Adding new column and index

In [62]:
df = pd.DataFrame(np.random.randint(1,100, size = (5,4)), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [63]:
df

    W   X   Y   Z
A  52  62  80  99
B  80  98  54  21
C  84  53  88  86
D  86  86  47  92
E  80  94  18  27

In [64]:
newind = 'CA NY OR WY CO'.split()

In [65]:
newind

['CA', 'NY', 'OR', 'WY', 'CO']

In [67]:
df['States'] = newind

In [68]:
df

    W   X   Y   Z States
A  52  62  80  99     CA
B  80  98  54  21     NY
C  84  53  88  86     OR
D  86  86  47  92     WY
E  80  94  18  27     CO

In [69]:
df.reset_index()

  index   W   X   Y   Z States
0     A  52  62  80  99     CA
1     B  80  98  54  21     NY
2     C  84  53  88  86     OR
3     D  86  86  47  92     WY
4     E  80  94  18  27     CO

In [70]:
df.set_index('States')

         W   X   Y   Z
States
CA      52  62  80  99
NY      80  98  54  21
OR      84  53  88  86
WY      86  86  47  92
CO      80  94  18  27

## Applying Conditions

In [3]:
df = pd.DataFrame(np.random.randint(1,100, size = (5,4)), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [72]:
df

    W   X   Y   Z
A  71  18  87  33
B  54  96  54  46
C  33  93  27  15
D  52  79   6  53
E  16  53  48  16

In [74]:
booldf = df > 80

In [75]:
booldf

       W      X      Y      Z
A  False  False   True  False
B  False   True  False  False
C  False   True  False  False
D  False  False  False  False
E  False  False  False  False

In [76]:
df[booldf]

    W     X     Y   Z
A NaN   NaN  87.0 NaN
B NaN  96.0   NaN NaN
C NaN  93.0   NaN NaN
D NaN   NaN   NaN NaN
E NaN   NaN   NaN NaN

In [77]:
df[df > 80]

    W     X     Y   Z
A NaN   NaN  87.0 NaN
B NaN  96.0   NaN NaN
C NaN  93.0   NaN NaN
D NaN   NaN   NaN NaN
E NaN   NaN   NaN NaN

In [80]:
df['W'] > 50

A     True
B     True
C    False
D     True
E    False
Name: W, dtype: bool

In [79]:
df

    W   X   Y   Z
A  71  18  87  33
B  54  96  54  46
C  33  93  27  15
D  52  79   6  53
E  16  53  48  16

In [81]:
df[df['W'] > 50]

    W   X   Y   Z
A  71  18  87  33
B  54  96  54  46
D  52  79   6  53

In [82]:
df['W'] > 50

A     True
B     True
C    False
D     True
E    False
Name: W, dtype: bool

In [83]:
df

    W   X   Y   Z
A  71  18  87  33
B  54  96  54  46
C  33  93  27  15
D  52  79   6  53
E  16  53  48  16

In [84]:
df['W'] > 50

A     True
B     True
C    False
D     True
E    False
Name: W, dtype: bool

In [85]:
df['Y']>30

A     True
B     True
C    False
D    False
E     True
Name: Y, dtype: bool

In [87]:
(df['W'] > 50) & (df['Y']>30)

A     True
B     True
C    False
D    False
E    False
dtype: bool

In [88]:
df[(df['W'] > 50) & (df['Y']>30)]

    W   X   Y   Z
A  71  18  87  33
B  54  96  54  46

In [4]:
(df['W'] > 50) | (df['Y']>30)

A    True
B    True
C    True
D    True
E    True
dtype: bool